export const COMMON_MSG = {
  auth: {
    login: 'Користувача за вказаним телефоном та паролем не знайдено'
  },
  job:{
    apply: 'Ви подали заявку на данну пропозицію',
    share: 'Ви поділилися обранною пропозицією з друзями',
    remove: 'Ви відхилили пропозицію'
  },
  my_job:{
    remove: 'Заявку видаленно'
  },
  user: {
    create: 'Реєстрація пройшла успішно. Увійдіть з вашими данними',
    err: 'Користувач з вказанним номером вже існує',
    empty: 'Заповніть всі поля',
    number: 'Номер телефону має бути 12 цифр',
    password: 'Пароль має бути 6-15 символів',
    update: 'Інформацію успішно оновлено',
    remove: 'Користувача успішно видаленно',
    emailerr: 'email не відповідає стандартам',
    field: 'Імя або прізвище не відповідає стандартам',
    city: 'Назва міста не відповідає стандартам'
  },
  skill: {
    create: 'Навички збережено успішно',
    update: 'Інформацію успішно оновлено',
    remove: 'Навички видаленні'
  },
  connection: {
    onConnect: "З'єднання з мережею поновлено",
    onDisconnect: "Відсутнє з'єднання з мережею"
  }
};
